// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

/*int Sum(int a)
{
    int result = 0;
    while(a > 0)
    {
        result += a % 10;
        a = a / 10;
    }
    return result;
}

Console.Write("Введите число: ");
int n1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Сумма цифр в числе равна " + Sum(n1));*/


// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.